[
    {
        "question_text_en": "How would you describe your overall experience with our service today?",
        "question_text_tl": "Paano mo ilalarawan ang kabuuang karanasan mo sa aming serbisyo ngayon?",
        "is_active": true,
        "category": "overall_experience"
    },
    {
        "question_text_en": "What did you think about the service staff's politeness and accommodation?",
        "question_text_tl": "Ano ang masasabi mo tungkol sa pakikitungo ng aming mga staff?",
        "is_active": true,
        "category": "staff"
    },
    {
        "question_text_en": "Were the instructions clear? If not, what part was unclear?",
        "question_text_tl": "Maliwanag bang naiparating ang mga instruksiyon sa iyo?",
        "is_active": true,
        "category": "instructions"
    },
    {
        "question_text_en": "Did you encounter any difficulties? Please describe them.",
        "question_text_tl": "May naranasan ka bang problema sa aming serbisyo? (Maaari mo bang maipaliwanag?)",
        "is_active": true,
        "category": "difficulties"
    },
    {
        "question_text_en": "What aspects of the service process did you find most helpful?",
        "question_text_tl": "Anong mga aspeto ng proseso ng serbisyo ang pinaka-nakatulong sa iyo?",
        "is_active": true,
        "category": "helpful_aspects"
    },
    {
        "question_text_en": "What was your overall impression of the waiting area?",
        "question_text_tl": "Ano ang iyong kabuuang impresyon sa lugar ng paghihintay?",
        "is_active": true,
        "category": "waiting_area"
    },
    {
        "question_text_en": "How would you describe your mood during the waiting process?",
        "question_text_tl": "Paano mo ilalarawan ang nararamdaman mo habang naghihintay?",
        "is_active": true,
        "category": "mood"
    },
    {
        "question_text_en": "How did you feel about the time it took to resolve your issue?",
        "question_text_tl": "Ano ang pakiramdam mo tungkol sa tagal ng oras na kinuha para maayos ang iyong problema?",
        "is_active": true,
        "category": "resolution_time"
    },
    {
        "question_text_en": "How would you describe the cleanliness and maintenance of the waiting area?",
        "question_text_tl": "Paano mo ipaliliwanag ang kalinisan at pangangalaga ng lugar ng paghihintay?",
        "is_active": true,
        "category": "cleanliness"
    },
    {
        "question_text_en": "Were there any distractions in the waiting area that affected your experience?",
        "question_text_tl": "Mayroon bang mga sagabal sa lugar ng paghihintay na nakaapekto sa iyong karanasan?",
        "is_active": true,
        "category": "distractions"
    }
]